app/controllers/api/transactions_controller.rb

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."symbol" = $1 LIMIT $2  [["symbol", "aapl"], ["LIMIT", 1]]
INSERT INTO "transactions" ("user_id", "stock_id", "price", "num_shares", "transactions_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["stock_id", 11], ["price", 300.0], ["num_shares", 3], ["transactions_type", "sell"], ["created_at", "2020-07-13 23:40:18.986301"], ["updated_at", "2020-07-13 23:40:18.986301"]]
---
    def create
        @transaction = Transaction.new(transaction_params)
        @stock = Stock.find_by(symbol: params[:transaction][:symbol])
        @transaction.stock_id = @stock.id
        @transaction.user_id = current_user.id

        transaction_amount = @transaction.price * @transaction.num_shares
        buying_power = current_user.calculate_buying_power
        shares_owned = current_user.shares_owned(@transaction.stock_id)


        if transaction_amount > buying_power && @transaction.transactions_type == 'buy'
            render json: ['Not enough buying power'], status: 401
        elsif @transaction.num_shares <= 0
            render json: ['Shares must be greater than 0'], status: 422
        elsif @transaction.num_shares > shares_owned && transaction.transactions_type == 'sell'
            render json: ['Not enough shares'], status: 401
        else
            if @transaction.save